"""Завдання 1: Створити функцію-генератор, що генерує ряд Фібоначі.
Назва функції - fibonacci_seq_generator. Аргументи функції-генератора відсутні.
 Генератор повинен повертати наступне просте число після кожного наступного виклику.

"""

def fibonacci_seq_generator():
    a, b = 0, 1 # початкові змінні
    while True:
        yield a
        a, b = b, a + b

# yield  - генератор після зупинки продовжить з того місця де зупинилась
gen = fibonacci_seq_generator()
while True:
    input("Enter щоб дістати число Фібоначі: ")
    print(next(gen))